{
  "developer": "Web developer",
  "presentation": "Presentation",
  "whoAmI": "Who I am ?",
  "intro_paragraph1": "I am a full stack developer, creating user interfaces that are intuitive and efficient with code that is both simple and readable.",
  "intro_paragraph2": "DISCOVER MY WORK",
  "intro_paragraph3": "Mastering HTML5, CSS3, JavaScript, React, Redux, Java, and Angular, I am ready to take on new challenges.",
  "skills": "Skills",
  "about": "A solution to your most complex needs!",
  "realisation": "Portfolio",
  "Tous": "All",
  "contact": "Want to learn more? Let me know.",
  "project": "SAY HELLO!",
  "name": "Name",
  "address": "E-mail address",
  "message": "Your message",
  "Submit": "Go!",
  "thanksMessage": "Thank you, I will get back to you as soon as possible! 🚀",
  "copyright": "All rights reserved.",
  "switch": "Change language",
  "Lien vers Github": "Link to Github",
  "Sophie Bluel": {
    "description": "In support within the ArchiWebos agency, I participate in the development of the portfolio site of an interior architect. The necessary elements, including the design on Figma, the back-end code, and a Kanban, are provided.",
    "mission": "The major missions consist of developing the presentation page of the architect's work from the existing HTML, creating the login page for the administrator, and setting up a media upload modal.",
    "missionResume": [
      "Management of user events with JavaScript",
      "Manipulation of DOM elements with JavaScript.",
      "Retrieving user data in JavaScript via forms.",
      "Creation of modal",
      "API management"
    ]
  },
  "Kasa": {
    "description": "Kasa, a platform for renting apartments between individuals, is recruiting a freelance front-end developer for its total overhaul. Leader in France with more than 500 daily ads, Kasa wants to migrate to a JavaScript stack with NodeJS on the back-end and React on the front-end, abandoning its old ASP.NET code of more than 10 years.",
    "mission": "As a freelance front-end developer, my mission is to initiate the React project for the overhaul of the Kasa site, a platform for renting apartments between individuals. I am in charge of developing the entire application, including React components and React Router routes, following the provided Figma mockups. Despite the temporary absence of the back-end, I must ensure quality code using a JSON file containing the last 20 housing ads. Compliance with Kasa's technical constraints and coding guidelines is imperative.",
    "missionResume": [
      "Configure navigation between pages with React Router.",
      "Develop interface elements using React components.",
      "Implement CSS animations.",
      "Develop a web interface using Sass.",
      "Initialize an application with Create React App."
    ]
  },
  "ArgentBank": {
    "description": "As a newly integrated front-end developer in the Argent Bank team, I actively collaborate with Mila, the project manager, to realize the user dashboard. Under the direction of CTO, Avery Moreau, who emphasizes the importance of deadlines, our goal is to propel Argent Bank as a new innovative online bank.",
    "mission": "My mission is to initiate the first phase of the Argent Bank user dashboard, focusing on user authentication. I will create a responsive web application with React, using Redux to manage the global state. The initial code, including the static HTML and CSS of the home, login, and profile pages, was provided to me. My goal is to allow users to navigate the site, log in, log out, and access specific post-login information. I will pay particular attention to image optimization and the creation of reusable components, in accordance with Green Code best practices.",
    "missionResume": [
      "Configure navigation between pages with React Router.",
      "Develop interface elements using React components.",
      "Implement CSS animations.",
      "Develop a web interface using Sass.",
      "Initialize an application with Create React App."
    ]
  },
  "Nina Carducci": {
    "description": "Nina Carducci, a photographer, enlisted my services as a freelance developer to optimize the SEO of her site ninacarducci.github.io.",
    "mission": "As a freelance developer, my mission is to optimize Nina Carducci's website, a photographer, to enhance its SEO and online performance. To achieve this goal, I will work on several aspects of the site, including reducing the image size for faster loading, restructuring the code to ensure optimal accessibility, and implementing local SEO through Schema.org. I will also add meta tags for social media and make accessibility-related adjustments. Finally, I will document all these actions in a detailed optimization report, including screenshots from Lighthouse, Wave, and Rich Snippet audits.",
    "missionResume": [
      "React Development",
      "State Management with Redux",
      "API Calls",
      "API Routes Configuration",
      "Swagger Documentation",
      "Green Code"
    ]
  },
  "Booki": {
    "description": "My internship takes place at the start-up Booki, where I begin as a web developer. My goal is to create a website allowing users to find accommodations and activities in the city of their choice.",
    "mission": "As a web developer at Booki, my mission is to integrate the website's mockups using HTML and CSS. I work closely with the CTO, Sarah, and the UI designer, Loïc. The desktop, tablet, and mobile mockups of the site are finalized, and I must follow the technical specifications provided in the summary note. I also receive a file structure for the site and an initial codebase to help me get started.",
    "missionResume": [
      "Implement a responsive interface with HTML and CSS.",
      "Set up a front-end development environment.",
      "Integrate content according to a mockup with HTML and CSS."
    ]
  },

  "Print It": {
    "description": "As a junior developer, I collaborate with Print It, a family-owned printing company for three generations. Under the guidance of Lucien, the director, we are working on modernizing the website.",
    "mission": "As a freelance front-end developer, I am tasked with revitalizing the static website of the Print It printing house by creating an interactive carousel. The steps include adding static elements, interacting with arrows and bullet points, as well as implementing infinite scrolling.",
    "missionResume": [
      "JavaScript programming",
      "Use of Git and GitHub",
      "Website Modernization",
      "Carousel Creation"
    ]
  },
  "OhMyFood": {
    "description": "As a junior developer at Ohmyfood, an expanding gastronomic startup in Paris, my mission is to create a mobile-first website listing menus from gourmet restaurants. The site also allows customers to compose their own menu for a wait-free dining experience. With the support of the sales team, we convinced 4 restaurateurs to use the platform, setting the initial number of menus to 4.",
    "mission": "My mission is to develop the Ohmyfood website using the mobile and desktop mockups provided by the UX designer. The site must be mobile-first, responsive, with the rigorous use of SASS and elaborate animations. Mockups, the site prototype via Figma, and source files are provided.",
    "missionResume": [
      "Integration of mobile-first mockups.",
      "Implementation of CSS animations.",
      "Use of SASS.",
      "Project versioning with Git and Github."
    ]
  },
  "724 Events": {
    "description": "The event agency 724events, specialized in event organization, is seeking my skills as a freelance front-end developer to address issues on its ongoing redesigned showcase website. With a focus on large-scale events, the agency aims to present a modern and dynamic image through its one-page site. Having already started the integration process, the agency faced unforeseen obstacles with the departure of the initial freelance developer. To maintain the project's momentum, Jean-Baptiste, the Marketing Director of the agency, contacted me to debug the site and finalize the recipe book that will ensure the proper functioning of each feature.",
    "mission": "The debugging mission for the 724events website involves resolving identified bugs in the existing code, based on provided indications. The recipe book started by the previous developer must be completed with comprehensive test scenarios. Debugging will be performed using Chrome DevTools, with the integration of unit tests to identify and fix issues.",
    "missionResume": [
      "Debugging with Chrome DevTools",
      "Unit testing",
      "Writing recipe book"
    ]
  },
  "Telesport": {
  "description": "The television channel TéléSport wants to create a new interactive web application to prepare for the upcoming Olympic Games. This application will allow users to view information from previous Olympic Games, such as the number of medals per country. You are responsible for developing the front-end of the dashboard using Angular, following best practices such as using services for HTTP calls, RxJS and observables, and strictly typing the code.",
  "mission": "Develop the front-end of the dashboard for TéléSport's interactive web application, following the mockups provided by the UX designer and adhering to the specifications in the requirements document. The code must be well-documented with a README explaining how to launch the application, and the application must be compatible with both mobile and desktop devices.",
  "missionResume": [
    "Front-end development with Angular",
    "Using services for HTTP calls",
    "Integration of RxJS and observables",
    "Strict typing of the code",
    "Mobile and desktop compatibility"
  ]
},
"Chatop": {
  "description": "ChâTop, a real estate rental company in a tourist area, wants to develop an online portal to allow potential tenants to contact the owners of the various properties they wish to rent. You are responsible for developing the back-end of this application using the provided technical specifications.",
  "mission": "Develop the back-end of the portal to connect future tenants and owners for seasonal rentals. The application must allow users to authenticate to access rental listings. The API must be documented with Swagger and tested with a Postman collection.",
  "missionResume": [
    "Back-end development",
    "Implementation of user authentication",
    "API documentation with Swagger",
    "API testing with Postman"
  ]
},
"NumDev": {
  "description": "NumDev, an agency specializing in the creation of business management applications for small local businesses, needs to finalize a booking application for Savasana, a yoga studio. You are responsible for performing the testing of the application, including front-end, back-end, and end-to-end tests.",
  "mission": "Perform the testing of the booking application for Savasana, including writing and executing front-end, back-end, and end-to-end tests. The tests must cover at least 80% of the code, with at least 30% integration tests. Document the API with Swagger and write a README to explain how to launch the application.",
  "missionResume": [
    "Perform front-end, back-end, and end-to-end tests",
    "Test coverage of at least 80% of the code",
    "At least 30% integration tests",
    "API documentation with Swagger"
  ]
},
"Monde des Devs": {
  "description": "ORION, a company specializing in software development, wants to create the next social network dedicated to developers: MDD (Monde de Dév). The goal of MDD is to help developers find jobs by facilitating connections and collaboration between peers with common interests. You are responsible for developing the MVP (Minimum Viable Product) of this application.",
  "mission": "Develop the MVP of the MDD application, allowing users to subscribe to programming-related topics, display a chronological news feed, write articles, and post comments. You need to make decisions regarding libraries, frameworks, design patterns, and tools to use, develop the front-end and back-end, and set up an appropriate database.",
  "missionResume": [
    "Making technical decisions (libraries, frameworks, design patterns, tools)",
    "Front-end development with Angular",
    "Back-end development with Java",
    "Setting up a MySQL database",
    "Integrating the mockups provided by the UX designer"
  ]
},
"BobApp": {
  "description": "BobApp is an application created by Bob, he needs help managing the increasing number of users and numerous reported bugs. You are responsible for setting up Continuous Integration/Continuous Delivery (CI/CD) workflows to automate tests, code quality checks, coverage report generation, and Docker container deployment.",
  "mission": "Set up complete CI/CD workflows for BobApp, including test validation on pull requests, running tests, checking code quality, generating coverage reports, and deploying containers to Docker Hub. Use GitHub Actions to automate these processes and integrate SonarQube for code quality analysis.",
  "missionResume": [
    "Setting up CI/CD workflows with GitHub Actions",
    "Validating tests on pull requests",
    "Running tests and checking code quality",
    "Generating coverage reports",
    "Deploying containers to Docker Hub",
    "Integrating SonarQube for code quality analysis"
  ]
},
"Your Car Your Way": {
  "description": "Your Car Your Way, a car rental company, wants to develop a new web application to allow all its customers to manage the car rental process. You are responsible for updating the 'Business Requirements' document, creating an 'Architecture Definition Document', and completing a 'Compliance Assessment'.",
  "mission": "Update the 'Business Requirements' document by adding missing features, create an 'Architecture Definition Document' to ensure the feasibility of the project, and complete a 'Compliance Assessment' to evaluate the project's compliance. Develop a proof of concept (PoC) for the online chat functionality with customer service.",
  "missionResume": [
    "Updating the 'Business Requirements' document",
    "Creating an 'Architecture Definition Document'",
    "Completing a 'Compliance Assessment'",
    "Developing a proof of concept (PoC) for the online chat"
  ]
},
"Portfolio": {
  "description": "Discover my personal portfolio, developed with React, showcasing my web development skills. This project is the most accomplished of my career and reflects my expertise in JavaScript, React, HTML, SASS, and SEO. Explore my achievements and projects to learn more about my professional journey.",
  "mission": "Create an attractive and interactive portfolio to showcase my web development skills and projects. Use React to build a modern and responsive user interface, and integrate SEO techniques to improve online visibility. Ensure a smooth and intuitive user experience across all devices.",
  "missionResume": [
    "Development of the user interface with React",
    "Integration of SASS for modular and maintainable styles",
    "SEO optimization for better online visibility",
    "Implementation of a responsive design for mobile compatibility",
    "Use of GitHub for version control and deployment"
  ]
}
}
