[
  {
    "title": "Sophie Bluel",
    "image": "/assets/Portfolio-Sophie-Buel-1.webp",
    "imagesSrc": [
      "/assets/Portfolio-Sophie-Buel-1.webp",
      "/assets/Portfolio-Sophie-Buel-2.webp",
      "/assets/Portfolio-Sophie-Buel-3.webp",
      "/assets/Portfolio-Sophie-Buel-4.webp"
    ],
    "hashtags": ["JavaScript", "DOM", "NodeJS", "Modal"],
    "categories": ["HTML", "JavaScript"],
    "skills": ["HTML", "JavaScript", "CSS", "Github", "VSCode"],
    "description": "En renfort au sein de l'agence ArchiWebos, je participe au développement du site portfolio d'une architecte d'intérieur. Les éléments nécessaires, dont le design sur Figma, le code back-end, et un Kanban, sont fournis.",
    "mission": "Les missions majeures consistent à développer la page de présentation des travaux de l'architecte à partir du HTML existant, créer la page de connexion pour l'administrateur, et mettre en place une modale d'upload de médias. ",
    "missionResume": [
      "Gestion des événements utilisateurs avec JavaScript ",
      "Manipulation des éléments du DOM avec JavaScript.",
      "Récupération des données utilisateurs dans le JavaScript via des formulaires.",
      "Création de modale",
      "Gestion d'API"
    ],
    "githubLink": "https://github.com/nolloV/Sophie_Bluel.git"
  },
  {
    "title": "Kasa",
    "image": "/assets/Portfolio-kasa.webp",
    "imagesSrc": [
      "/assets/Portfolio-kasa.webp",
      "/assets/Portfolio-kasa-2.webp",
      "/assets/Portfolio-kasa-3.webp"
    ],
    "hashtags": ["JavaScript", "React", "Git", "NodeJS"],
    "categories": ["React", "JavaScript"],
    "skills": [
      "HTML",
      "JavaScript",
      "React",
      "CSS",
      "SASS",
      "Figma",
      "Github",
      "VSCode"
    ],
    "description": "Kasa, une plateforme de location d'appartements entre particuliers, recrute un développeur front-end freelance pour sa refonte totale. Leader en France avec plus de 500 annonces quotidiennes, Kasa veut migrer vers une stack JavaScript avec NodeJS côté back-end et React côté front-end, abandonnant son ancien code ASP.NET de plus de 10 ans.",
    "mission": "En tant que développeur front-end freelance, ma mission consiste à initier le projet React pour la refonte du site Kasa, une plateforme de location d'appartements entre particuliers. Je suis chargé de développer l'intégralité de l'application, notamment les composants React et les routes React Router, en suivant les maquettes Figma fournies. Malgré l'absence temporaire du back-end, je dois assurer un code de qualité en utilisant un fichier JSON contenant les 20 dernières annonces de logements. Le respect des contraintes techniques et des coding guidelines de Kasa est impératif.",
    "missionResume": [
      "Configurer la navigation entre les pages avec React Router.",
      "Développer des éléments d'interface à l'aide de composants React.",
      "Mettre en œuvre des animations CSS.",
      "Développer une interface web en utilisant Sass.",
      "Initialiser une application avec Create React App."
    ],
    "githubLink": "https://github.com/nolloV/Kasa"
  },
  {
    "title": "ArgentBank",
    "image": "/assets/Portfolio-ArgentBank.webp",
    "imagesSrc": [
      "/assets/Portfolio-ArgentBank.webp",
      "/assets/Portfolio-ArgentBank-2.webp",
      "/assets/Portfolio-ArgentBank-3.webp"
    ],
    "hashtags": ["JavaScript", "React", "Redux", "Swagger"],
    "categories": ["React", "JavaScript"],
    "skills": [
      "JavaScript",
      "React",
      "NodeJS",
      "Redux",
      "HTML",
      "CSS",
      "Github",
      "VSCode"
    ],
    "description": "En tant que développeur front-end fraîchement intégré à l'équipe d'Argent Bank, je collabore activement avec Mila, la cheffe de projet, pour concrétiser le tableau de bord des utilisateurs. Sous la direction du CTO, Avery Moreau, qui souligne l'importance des délais, notre objectif est de propulser Argent Bank en tant que nouvelle banque en ligne innovante.",
    "mission": "Ma mission consiste à initier la première phase du tableau de bord des utilisateurs d'Argent Bank, en mettant l'accent sur l'authentification des utilisateurs. Je vais créer une application web réactive avec React, utilisant Redux pour gérer l'état global. Le code initial, comprenant le HTML et le CSS statiques des pages d'accueil, de connexion, et de profil, m'a été fourni. Mon objectif est de permettre aux utilisateurs de naviguer sur le site, de se connecter, de se déconnecter, et d'accéder à des informations spécifiques post-connexion. Je veillerai particulièrement à l'optimisation des images et à la création de composants réutilisables, conformément aux bonnes pratiques du Green Code.",
    "missionResume": [
      "Configurer la navigation entre les pages avec React Router.",
      "Développer des éléments d'interface à l'aide de composants React.",
      "Mettre en œuvre des animations CSS.",
      "Développer une interface web en utilisant Sass.",
      "Initialiser une application avec Create React App."
    ],
    "githubLink": "https://github.com/nolloV/ArgentBank.git"
  },
  {
    "title": "Nina Carducci",
    "image": "/assets/Portfolio-Nina-Carducci-1.webp",
    "imagesSrc": [
      "/assets/Portfolio-Nina-Carducci-1.webp",
      "/assets/Portfolio-Nina-Carducci-2.webp",
      "/assets/Portfolio-Nina-Carducci-3.webp"
    ],
    "hashtags": ["SEO", "Métas", "Green Code"],
    "categories": ["Debug", "SEO"],
    "skills": ["CSS", "HTML", "JavaScript", "Github", "VSCode"],
    "description": "Nina Carducci, photographe, a sollicité mes services de développeur freelance pour optimiser le référencement de son site ninacarducci.github.io.",
    "mission": "En tant que développeur freelance, ma mission consiste à optimiser le site web de Nina Carducci, une photographe, pour améliorer son référencement et ses performances en ligne. Pour atteindre cet objectif, je vais travailler sur plusieurs aspects du site, notamment en réduisant la taille des images pour accélérer le chargement, en restructurant le code pour garantir une accessibilité optimale, et en mettant en place un référencement local grâce à Schema.org. Je vais également ajouter des balises métas pour les réseaux sociaux et effectuer des ajustements liés à l'accessibilité. Enfin, je vais documenter toutes ces actions dans un rapport d'optimisation détaillé, qui inclura des captures d'écran des audits Lighthouse, Wave, et Rich Snippet",
    "missionResume": [
      "Développement React",
      "Gestion d'État avec Redux ",
      "Appels API",
      "Configuration des Routes API",
      "Swagger Documentation",
      "Green Code"
    ],
    "githubLink": "https://github.com/nolloV/Nina_Carducci.git"
  },
  {
    "title": "Booki",
    "image": "/assets/Portfolio-Booki.webp",
    "imagesSrc": [
      "/assets/Portfolio-Booki.webp",
      "/assets/Portfolio-Booki-2.webp",
      "/assets/Portfolio-Booki-3.webp"
    ],
    "hashtags": ["HTML", "CSS", "Figma"],
    "categories": ["HTML"],
    "skills": ["HTML", "Figma", "CSS", "VSCode"],
    "description": "Mon alternance se déroule au sein de la start-up Booki, où je débute en tant que développeur web. Mon objectif est de créer un site Internet permettant aux utilisateurs de trouver des hébergements et des activités dans la ville de leur choix.",
    "mission": "En tant que développeur web chez Booki, ma mission consiste à intégrer les maquettes du site en utilisant du code HTML et CSS. Je travaille en étroite collaboration avec la CTO, Sarah, et l'UI designer, Loïc. Les maquettes desktop, tablette et mobile du site sont finalisées, et je dois suivre les spécifications techniques fournies dans la note de synthèse. Je reçois également une structure de fichiers du site et une base de code initiale pour m'aider à démarrer.",
    "missionResume": [
      "Implémenter une interface responsive avec HTML et CSS.",
      "Installer un environnement de développement front-end.",
      "Intégrer du contenu conformément à une maquette avec HTML et CSS."
    ],
    "githubLink": "https://github.com/nolloV/Sophie_Bluel.git"
  },
  {
    "title": "Print It",
    "image": "/assets/Portfolio-Printit.webp",
    "imagesSrc": ["/assets/Portfolio-Printit.webp"],
    "hashtags": ["JavaScript", "HTML", "CSS"],
    "categories": ["JavaScript"],
    "skills": ["HTML", "JavaScript", "CSS", "Github", "VSCode"],
    "description": "En tant que développeur junior, je collabore avec Print It, une imprimerie familiale depuis trois générations. Sous la direction de Lucien, le directeur, nous travaillons à moderniser le site.",
    "mission": "En tant que développeur front-end en freelance, je suis chargé de dynamiser le site web statique de l'imprimerie Print it en créant un carrousel interactif. Les étapes incluent l'ajout d'éléments statiques, l'interaction avec des flèches et des bullet points, ainsi que la mise en place d'un défilement infini.",
    "missionResume": [
      "Programmation en JavaScript",
      "Utilisation de Git et GitHub",
      "Modernisation du Site",
      "Création d'un Carrousel"
    ],
    "githubLink": "https://github.com/nolloV/Printit.git"
  },
  {
    "title": "OhMyFood",
    "image": "/assets/Portfolio-Ohmyfood.webp",
    "imagesSrc": [
      "/assets/Portfolio-Ohmyfood.webp",
      "/assets/Portfolio-Ohmyfood-2.webp",
      "/assets/Portfolio-Ohmyfood-3.webp"
    ],
    "hashtags": ["HTML", "CSS", "Animation"],
    "categories": ["HTML"],
    "skills": ["SASS", "HTML", "CSS", "Figma", "Github", "VSCode"],
    "description": "En tant que développeur junior chez Ohmyfood, une start-up gastronomique en expansion à Paris, ma mission est de créer un site mobile first répertoriant les menus de restaurants gastronomiques. Le site permet également aux clients de composer leur propre menu pour une expérience sans attente au restaurant. Avec l'appui de l'équipe commerciale, nous avons convaincu 4 restaurateurs d'utiliser la plateforme, fixant ainsi le nombre initial de menus à 4.",
    "mission": "Ma mission consiste à développer le site Ohmyfood en utilisant les maquettes mobile et desktop fournies par l'UX designer. Le site doit être mobile first, responsive, avec l'usage rigoureux de SASS et des animations élaborées. Les maquettes, le prototype du site via Figma, et les fichiers sources sont fournis.",
    "missionResume": [
      "Intégration de maquettes en mobile-first.",
      "Mise en œuvre d'animations CSS.",
      "Utilisation de SASS.",
      "Versionnage du projet avec Git et Github."
    ],
    "githubLink": "https://github.com/nolloV/ohmyfood.git"
  },
  {
    "title": "724 Events",
    "image": "/assets/Portfolio-724.webp",
    "imagesSrc": ["/assets/Portfolio-724.webp", "/assets/Portfolio-724-2.webp"],
    "hashtags": ["JavaScript", "Debug", "DevTools", "React"],
    "categories": ["Debug", "React", "JavaScript"],
    "skills": ["HTML", "CSS", "JavaScript", "React", "Github", "VSCode"],
    "description": "L'agence événementielle 724events, spécialisée dans l'organisation d'événements, recherche mes compétences en tant que développeur front-end freelance pour résoudre des problèmes sur son site vitrine en cours de refonte. Avec une orientation vers les événements d'envergure, l'agence vise à présenter une image moderne et dynamique à travers son site one-page. Ayant déjà entamé le processus d'intégration, l'agence a dû faire face à des obstacles imprévus avec le départ du premier développeur freelance.Afin de maintenir l'élan du projet, Jean-Baptiste, le directeur Marketing de l'agence, m'a contacté pour débugger le site et finaliser le cahier de recette qui garantira le bon fonctionnement de chaque fonctionnalité.",
    "mission": "    La mission de déboggage pour le site web de 724events consiste à résoudre les bugs identifiés dans le code existant, en se basant sur les indications fournies . Le cahier de recette commencé par le développeur précédent doit être finalisé avec des scénarios de tests exhaustifs. Le déboggage sera effectué à l'aide des Chrome DevTools, avec l'intégration de tests unitaires pour identifier et corriger les problèmes.",
    "missionResume": [
      "Déboggage avec Chrome DevTools",
      "Tests unitaires ",
      "Rédaction de cahier de recette"
    ],
    "githubLink": "https://github.com/nolloV/724events.git"
  },
  {
    "title": "Telesport",
    "image": "/assets/Portfolio-Telesport.webp",
    "imagesSrc": ["/assets/Portfolio-Telesport.webp", "/assets/Portfolio-Telesport-2.webp"],
    "hashtags": ["Angular","JavaScript","HTML","CSS"],
    "categories": ["Angular", "HTML", "JavaScript"],
    "skills": ["HTML", "CSS", "JavaScript", "Angular", "Github", "VSCode"],
    "description": "La chaîne de télévision TéléSport souhaite créer une nouvelle application web interactive pour préparer les prochains Jeux Olympiques. Cette application permettra aux utilisateurs de visualiser les informations des précédents Jeux olympiques, comme le nombre de médailles par pays. Vous êtes chargé de développer le front-end du dashboard en utilisant Angular, en suivant les bonnes pratiques telles que l'utilisation de services pour les appels HTTP, RxJS et les observables, et en typant le code de manière stricte.",
    "mission": "Développer le front-end du dashboard pour l'application web interactive de TéléSport, en suivant les maquettes fournies par l'UX designer et en respectant les spécifications du cahier des charges. Le code doit être bien documenté avec un README expliquant comment lancer l'application, et l'application doit être compatible avec les appareils mobiles et les ordinateurs.",
    "missionResume": [
      "Développement du front-end avec Angular",
      "Utilisation de services pour les appels HTTP",
      "Intégration de RxJS et des observables",
      "Typage strict du code",
      "Compatibilité mobile et ordinateur"
    ],
    "githubLink": "https://github.com/nolloV/Telesport.git"
  },
  {
    "title": "Chatop",
    "image": "/assets/Portfolio-Chatop.webp",
    "imagesSrc": ["/assets/Portfolio-Chatop.webp", "/assets/Portfolio-Chatop-2.webp", "/assets/Portfolio-Chatop-3.webp"],
    "hashtags": ["Java", "Srping", "Angular", "API"],
    "categories": ["Angular", "Java", "JavaScript"],
    "skills": ["Java", "JavaScript", "Angular", "Github", "VSCode", "MySQL"],
    "description": "ChâTop, une société de location immobilière dans une zone touristique, souhaite développer un portail en ligne pour permettre aux locataires potentiels de contacter les propriétaires des différentes propriétés qu'ils souhaitent louer. Vous êtes chargé de développer le back-end de cette application en utilisant les spécifications techniques fournies.",
    "mission": "Développer le back-end du portail de mise en relation entre les futurs locataires et les propriétaires pour de la location saisonnière. L'application doit permettre aux utilisateurs de s'authentifier pour accéder aux annonces de locations. L'API doit être documentée avec Swagger et testée avec une collection Postman.",
    "missionResume": [
      "Développement du back-end",
      "Implémentation de l'authentification des utilisateurs",
      "Documentation de l'API avec Swagger",
      "Tests de l'API avec Postman"
    ],
    "githubLink": "https://github.com/nolloV/Chatop.git"
  },
  {
    "title": "NumDev",
    "image": "/assets/Portfolio-Numdev.webp",
    "imagesSrc": ["/assets/Portfolio-Numdev.webp"],
    "hashtags": ["Java", "Jest", "Angular", "MySQL", "Debug"],
    "categories": ["Debug", "Angular", "Java"],
    "skills": ["Java", "Angular", "Github", "VSCode", "MySQL"],
    "description": "NumDev, une agence spécialisée dans la création d'applications de gestion d’entreprise pour les petites entreprises locales, a besoin de finaliser une application de réservation pour Savasana, un studio de yoga. Vous êtes chargé de réaliser le testing de l'application, incluant les tests front-end, back-end et end-to-end.",
    "mission": "Réaliser le testing de l'application de réservation pour Savasana, incluant l’écriture et l’exécution des tests front-end, back-end et end-to-end. Les tests doivent couvrir au moins 80 % du code, avec au moins 30 % de tests d’intégration. Documenter l'API avec Swagger et rédiger un README pour expliquer comment lancer l'application.",
    "missionResume": [
      "Réalisation des tests front-end, back-end et end-to-end",
      "Couverture de tests d'au moins 80 % du code",
      "Au moins 30 % de tests d’intégration",
      "Documentation de l'API avec Swagger"
    ],
    "githubLink": "https://github.com/nolloV/Cengiz.git"
  },
  {
    "title": "Monde des Devs",
    "image": "/assets/Portfolio-MDD.webp",
    "imagesSrc": ["/assets/Portfolio-MDD.webp", "/assets/Portfolio-MDD-2.webp", "/assets/Portfolio-MDD-3.webp", "/assets/Portfolio-MDD-4.webp", "/assets/Portfolio-MDD-5.webp"],
    "hashtags": ["Java", "Angular", "MySQL", "JavaScript"],
    "categories": ["Angular", "Java"],
    "skills": ["Java", "Angular", "Github", "VSCode", "MySQL"],
    "description": "ORION, une entreprise spécialisée dans le développement logiciel, souhaite créer le prochain réseau social dédié aux développeurs : MDD (Monde de Dév). Le but de MDD est d’aider les développeurs à trouver un emploi en facilitant les connexions et la collaboration entre pairs ayant des intérêts communs. Vous êtes chargé de réaliser le MVP (Minimum Viable Product) de cette application.",
    "mission": "Développer le MVP de l'application MDD, permettant aux utilisateurs de s’abonner à des sujets liés à la programmation, d'afficher un fil d’actualité chronologique, d'écrire des articles et de poster des commentaires. Vous devez prendre des décisions concernant les librairies, frameworks, design patterns et outils à utiliser, développer le front-end et le back-end, et mettre en place une base de données adaptée.",
    "missionResume": [
      "Prise de décisions techniques (librairies, frameworks, design patterns, outils)",
      "Développement du front-end avec Angular",
      "Développement du back-end avec Java",
      "Mise en place d'une base de données MySQL",
      "Intégration des maquettes fournies par l'UX designer"
    ],
    "githubLink": "https://github.com/nolloV/MDD.git"
  },
  {
    "title": "BobApp",
    "image": "/assets/Portfolio-Bobapp.webp",
    "imagesSrc": ["/assets/Portfolio-Bobapp.webp"],
    "hashtags": ["Java", "Angular", "MySQL", "Github"],
    "categories": ["Angular", "Java"],
    "skills": ["Java", "Angular", "Github", "VSCode"],
    "description": "BobApp est une application créée par Bob, il a besoin d'aide pour gérer l'augmentation du nombre d'utilisateurs et les nombreux bugs signalés. Vous êtes chargé de mettre en place des workflows de Continuous Integration/Continuous Delivery (CI/CD) pour automatiser les tests, la vérification de la qualité du code, la génération des rapports de couverture et le déploiement des conteneurs Docker.",
    "mission": "Mettre en place des workflows CI/CD complets pour BobApp, incluant la validation des tests sur les pull requests, l'exécution des tests, la vérification de la qualité du code, la génération des rapports de couverture, et le déploiement des conteneurs sur Docker Hub. Utiliser GitHub Actions pour automatiser ces processus et intégrer SonarQube pour l'analyse de la qualité du code.",
    "missionResume": [
      "Mise en place de workflows CI/CD avec GitHub Actions",
      "Validation des tests sur les pull requests",
      "Exécution des tests et vérification de la qualité du code",
      "Génération des rapports de couverture",
      "Déploiement des conteneurs sur Docker Hub",
      "Intégration de SonarQube pour l'analyse de la qualité du code"
    ],
    "githubLink": "https://github.com/nolloV/Gerez-un-projet-collaboratif-en-int-grant-une-demarche-CI-CD"
  },
  {
    "title": "Your Car Your Way",
    "image": "/assets/Portfolio-YCYW.webp",
    "imagesSrc": ["/assets/Portfolio-YCYW.webp", "/assets/Portfolio-YCYW-1.webp", "/assets/Portfolio-YCYW-2.webp"],
    "hashtags": ["Java", "Angular", "MySQL", "Github"],
    "categories": ["Angular", "Java"],
    "skills": ["Java", "Angular", "Github", "VSCode"],
    "description": "Your Car Your Way, une entreprise de location de voitures, souhaite développer une nouvelle application web pour permettre à tous ses clients de gérer la procédure de location de voitures. Vous êtes chargé de mettre à jour le document 'Business Requirements', de réaliser un 'Architecture Definition Document' et de compléter un 'Compliance Assessment'.",
    "mission": "Mettre à jour le document 'Business Requirements' en ajoutant les fonctionnalités manquantes, réaliser un 'Architecture Definition Document' pour s'assurer de la faisabilité du projet, et compléter un 'Compliance Assessment' pour évaluer la conformité du projet. Développer une preuve de concept (PoC) pour la fonctionnalité de chat en ligne avec le service client.",
    "missionResume": [
      "Mise à jour du document 'Business Requirements'",
      "Réalisation d'un 'Architecture Definition Document'",
      "Complétion d'un 'Compliance Assessment'",
      "Développement d'une preuve de concept (PoC) pour le chat en ligne"
    ],
    "githubLink": "https://github.com/nolloV/P13_PoC"
  },
  {
    "title": "Portfolio",
    "image": "/assets/Portfolio-perso.webp",
    "imagesSrc": ["/assets/Portfolio-perso.webp", "/assets/Portfolio-perso-1.webp", "/assets/Portfolio-perso-2.webp", "/assets/Portfolio-perso-3.webp"],
    "hashtags": ["React", "HTML", "SASS", "Github"],
    "categories": ["React", "JavaScript", "HTML", "SEO"],
    "skills": ["JavaScript", "React", "Github", "VSCode", "SASS"],
    "description": "Découvrez mon portfolio personnel, développé avec React, qui met en avant mes compétences en développement web. Ce projet est le plus abouti de ma carrière et reflète mon expertise en JavaScript, React, HTML, SASS et SEO. Explorez mes réalisations et projets pour en savoir plus sur mon parcours professionnel.",
    "mission": "Créer un portfolio attrayant et interactif pour présenter mes compétences et projets en développement web. Utiliser React pour construire une interface utilisateur moderne et réactive, et intégrer des techniques de SEO pour améliorer la visibilité en ligne. Assurer une expérience utilisateur fluide et intuitive sur tous les appareils.",
    "missionResume": [
      "Développement de l'interface utilisateur avec React",
      "Intégration de SASS pour des styles modulaires et maintenables",
      "Optimisation SEO pour une meilleure visibilité en ligne",
      "Mise en place d'un design responsive pour une compatibilité mobile",
      "Utilisation de GitHub pour le contrôle de version et le déploiement"
    ],
    "githubLink": "https://github.com/nolloV/Vollon"
  }
]
